Revit 2027 API
OverrideGraphicSettings.SurfaceBackgroundPatternId Property
 The ElementId of the surface background fill pattern override. A value of InvalidElementId means no override is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SurfaceBackgroundPatternId { get; }
Public ReadOnly Property SurfaceBackgroundPatternId As ElementId
	Get
public:
property ElementId^ SurfaceBackgroundPatternId {
	ElementId^ get ();
}
member SurfaceBackgroundPatternId : ElementId with get
Property Value
ElementId
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace